---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.SketchFailures.AxisNotSpecified
source: html/c6b272a8-1b37-838f-0ca7-91ea506f75d0.htm
---
# Autodesk.Revit.DB.BuiltInFailures.SketchFailures.AxisNotSpecified Property

Axis of revolution not specified.

## Syntax (C#)
```csharp
public static FailureDefinitionId AxisNotSpecified { get; }
```